In [1]:
install.packages('xlsx')

Installing package into 'C:/Users/nqhuy/OneDrive/Documents/R/win-library/4.1'
(as 'lib' is unspecified)

package 'xlsx' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\nqhuy\AppData\Local\Temp\RtmpuURLgq\downloaded_packages

In [3]:
install.packages('rJava')

Installing package into 'C:/Users/nqhuy/OneDrive/Documents/R/win-library/4.1'
(as 'lib' is unspecified)

package 'rJava' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\nqhuy\AppData\Local\Temp\RtmpuURLgq\downloaded_packages

In [4]:
install.packages('xlsxjars')

Installing package into 'C:/Users/nqhuy/OneDrive/Documents/R/win-library/4.1'
(as 'lib' is unspecified)

package 'xlsxjars' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\nqhuy\AppData\Local\Temp\RtmpuURLgq\downloaded_packages

In [7]:
library('xlsx')

In [9]:
# read data: read.xlsx('file directory', sheetIndex = [sheet name])
data = read.xlsx('Du_lieu/emp_data.xlsx', sheetIndex = 1)
data

  id name     salary start_date dept
1 1  Rick     623.30 2012-01-01 IT
2 2  Dan      515.20 2013-09-23 Operations
3 3  Michelle 611.00 2014-11-15 IT
4 4  Ryan     729.00 2014-05-11 HR
5    Gary     843.25 2015-03-27 Finance
6 6  Nina     578.00 2013-05-21 IT
7 7  Simon    632.80 2013-07-30 Operations
8 8  Guru     722.50 2014-06-17 Finance

In [10]:
city = read.xlsx('Du_lieu/emp_data.xlsx', sheetName = 'city')
print(city)

      name    city
1     Rick Seattle
2      Dan   Tampa
3 Michelle Chicago
4     Ryan Seattle
5     Gary Houston
6     Nina  Boston
7    Simon  Mumbai
8     Guru  Dallas

In [12]:
it_emp = read.xlsx('Du_lieu/emp_IT.xlsx', sheetIndex = 1)
it_emp

  NA. id name     salary start_date dept
1 1   1  Rick     623.3  2012-01-01 IT
2 3   3  Michelle 611.0  2014-11-15 IT
3 6   6  Nina     578.0  2013-05-21 IT

In [13]:
# write excel:
# write.xlsx(dataFrame_name, file = 'file_directory', sheetName = ,
#       [col.names = TRUE, row.names =, append = , showNA = T of F])

In [15]:
write.xlsx(it_emp, file = 'Du_lieu_new/emp_data.xlsx', sheetName = 'Sheet1',
          append = F, row.names = F)

In [17]:
new_data = read.xlsx('Du_lieu_new/emp_data.xlsx', sheetName = 'Sheet1')

In [18]:
new_data

  NA. id name     salary start_date dept
1 1   1  Rick     623.3  2012-01-01 IT
2 3   3  Michelle 611.0  2014-11-15 IT
3 6   6  Nina     578.0  2013-05-21 IT

In [19]:
write.xlsx(it_emp, file = 'Du_lieu_new/emp_data.xlsx', sheetName = 'Sheet2',
          append = T)

In [20]:
new_data2 = read.xlsx('Du_lieu_new/emp_data.xlsx', sheetName = 'Sheet2')
new_data2

  NA..1 NA. id name     salary start_date dept
1 1     1   1  Rick     623.3  2012-01-01 IT
2 2     3   3  Michelle 611.0  2014-11-15 IT
3 3     6   6  Nina     578.0  2013-05-21 IT